Repository: open-transport-mallorca/ViaMallorca
Catalog: lib/localization/app_*.arb
Languages: ca, uk

source: Home
ca: Inici
uk: Домашня

source: Stations
ca: Estacions
uk: Станції

source: Routes
ca: Rutes
uk: Маршрути

source: Map
ca: Mapa
uk: Карта

source: Warnings
ca: Advertències
uk: Попередження

source: News
ca: Notícies
uk: Новини

source: Theme
ca: Tema
uk: Тема

source: Light
ca: Clar
uk: Світла

source: Dark
ca: Oscur
uk: Темна

source: Language
ca: Llengua
uk: Мова

source: System
ca: Sistema
uk: Система

# rate
source: Rate the app
ca: Valora l'aplicació
uk: Оцініть додаток

# pleaseWait
source: Please wait a moment while we fetch the latest data.
ca: Si us plau, espera un moment mentre obtenim les dades més recents.
uk: Будь ласка, зачекайте момент, поки ми отримуємо останні дані.

source: Loading...
ca: Carregant...
uk: Завантаження...

source: Nearby
ca: Proper
uk: Поблизу

source: Nearby stations
ca: Estacions properes
uk: Станції поблизу

# distance
source: Distance {distance} m
ca: Distància {distance} m
uk: Відстань {distance} м

# locationDisabled
source: Location services are disabled
ca: Els serveis de localització estan desactivats
uk: Служби локації вимкнені

# enableLocation
source: Enable location services
ca: Activa els serveis de localització
uk: Увімкнути служби локації

source: Location denied forever
ca: Localització denegada permanentment
uk: Доступ до локацій заборонено назавжди

# locationDeniedText
source: You have denied location permissions forever
ca: Has denegat els permisos de localització permanentment
uk: Ви назавжди відмовилися від дозволів на локацію

# locationDeniedAction
source: Please enable location services in app settings to use this feature
ca: Si us plau, activa els serveis de localització a la configuració de l'aplicació per utilitzar aquesta funció
uk: Будь ласка, увімкніть служби локації у налаштуваннях додатка для використання цієї функції

source: Cancel
ca: Cancel·la
uk: Скасувати

source: Info
ca: Informació
uk: Інфо

# noDepartures
source: There are no departures for the next couple of hours. Please check back later.
ca: No hi ha sortides en les properes hores. Si us plau revisa més tard.
uk: Протягом наступних кількох годин відправлення відсутні. Будь ласка, перевірте пізніше.

source: Track
ca: Rastrejar
uk: Стежити

# searchLine
source: Search for a line
ca: Cerca una línia
uk: Шукати лінію

# noResults
source: No results found
ca: No s'han trobat resultats
uk: Результатів не знайдено

# searchStation
source: Search for a station
ca: Cerca una estació
uk: Шукати станцію

source: Timetable viewer
ca: Visualitzador d'horaris
uk: Переглядач розкладу

source: Error
uk: Помилка

source: Warning
ca: Advertència
uk: Попередження

source: Passengers
ca: Passatgers
uk: Пасажири

source: Speed
ca: Velocitat
uk: Швидкість

source: Next stop
ca: Propera parada
uk: Наступна зупинка

source: Final stop
ca: Parada final
uk: Кінцева зупинка

source: Untrack route
ca: Deixa de seguir la ruta
uk: Припинити відстеження маршруту

source: Stop tracking
ca: Atura el seguiment
uk: Зупинити відстеження

source: No station
ca: Cap estació
uk: Станцій немає

source: All
ca: Totes
uk: Всі

source: Favourites
ca: Preferits
uk: Улюблені

source: Stations on route
ca: Estacions en la ruta
uk: Станції на маршруті

source: Estimated
ca: Estimat
uk: Очікується

source: Scheduled
ca: Programat
uk: Заплановано

source: Arriving late
ca: Arribant tard
uk: Запізнюється

# arrivingIn
source: {count, plural, =0{now} one{1 minute} other{{count} minutes}}
ca: {count, plural, =0{ara} one{1 minut} other{{count} minuts}}
uk: {count, plural, =0{зараз} one{1 хвилина} other{{count} хвилин}}

source: Open settings
ca: Obre la configuració
uk: Відкрити налаштування

# notificationDialogTitle
source: Departure reminder for {lineCode}
ca: Notificació de sortida per a {lineCode}
uk: Нагадування про відправлення {lineCode}

# notificationDialogSubtitle
source: Schedule a notification for this departure
ca: Programa una notificació per a aquesta sortida
uk: Заплануйте нагадування для цього відправлення

source: Notify me
ca: Notifica'm
uk: Повідомити за

source: minutes before
ca: minuts abans
uk: хвилин

# alreadyScheduled
source: You already have a notification scheduled for this departure
ca: Ja tens una notificació programada per a aquesta sortida
uk: Ви вже запланували нагадування для цього відправлення

# notificationChannelName
source: Bus Departures
ca: Sortides d'autobús
uk: Відправлення автобусів

# notificationTitle
source: Departure reminder for {lineCode}
ca: Recordatori de sortida per a {lineCode}
uk: Нагадування про відправлення {lineCode}

# notificationBody
source: Your bus {lineCode} is departing in {minutes} minutes
ca: El teu autobús {lineCode} surt d'aquí a {minutes} minuts
uk: Ваш автобус {lineCode} вирушає через {minutes} хвилин

# notificationBodyApprox
source: Your bus {lineCode} is departing soon
ca: El teu autobús {lineCode} sortirà aviat
uk: Ваш автобус {lineCode} скоро вирушає

# notificationScheduled
source: Notification scheduled for {lineCode} at {time}
ca: Notificació programada per a {lineCode} a les {time}
uk: Нагадування заплановано для {lineCode} о {time}

# notificationScheduledApprox
source: Notification scheduled for {lineCode} at approximately {time}
ca: Notificació programada per a {lineCode} aproximadament a les {time}
uk: Нагадування заплановано для {lineCode} приблизно о {time}

source: Schedule notification
ca: Programar notificació
uk: Запланувати нагадування

source: Pending notifications
ca: Notificacions pendents
uk: Очікувані нагадування

# noPendingNotifications
source: You have no pending notifications
ca: No tens notificacions pendents
uk: У вас немає очікуваних нагадувань

# scheduledFor
source: Scheduled for: {time}
ca: Programat per a: {time}
uk: Заплановано на: {time}

source: Cancel all notifications
ca: Cancel·la totes les notificacions
uk: Скасувати всі нагадування

# notificationDeniedDialogTitle
source: Notification permission
ca: Permís de notificació
uk: Дозвіл на сповіщення

# notificationDeniedDialogSubtitle
source: You have denied the notification permission. Please enable it in the app settings to receive notifications.
ca: Has denegat el permís de notificació. Activa'l a la configuració de l'aplicació per rebre notificacions.
uk: Ви відхилили дозвіл на сповіщення. Будь ласка, увімкніть його в налаштуваннях програми, щоб отримувати сповіщення.

# remindersDeniedDialogTitle
source: Precise Notifications
ca: Notificacions precises
uk: Точні сповіщення

# remindersDeniedDialogSubtitle
source: To receive precise notifications, please allow scheduled alarms for Via Mallorca.
ca: Per rebre notificacions precises, permet les alarmes programades per a Via Mallorca.
uk: Щоб отримувати точні сповіщення, дозвольте заплановані будильники для Via Mallorca.

source: Use inexact
ca: Utilitza inexacte
uk: Використовувати неточні

source: Allow exact
ca: Permet exacte
uk: Дозволити точні

# switchToExact
source: Switch to exact notifications
ca: Canvia a notificacions exactes
uk: Перемкнутися на точні сповіщення

# switchToInexact
source: Switch to inexact notifications
ca: Canvia a notificacions inexactes
uk: Перемкнутися на неточні сповіщення
